app/controllers/activities_controller.rb

SELECT  `activities`.* FROM `activities`  WHERE (collection_id IN (3) or user_id = 1) AND (CONCAT(item_type, ',', action) IN ('collection,imported','collection,csv_imported','collection,deleted','layer,created','layer,changed','layer,deleted','site,created','site,changed','site,deleted'))  ORDER BY id desc LIMIT 25
SELECT `collections`.* FROM `collections` INNER JOIN `memberships` ON `collections`.`id` = `memberships`.`collection_id` WHERE `memberships`.`user_id` = 1  ORDER BY collections.name ASC
SELECT `users`.* FROM `users`  WHERE `users`.`id` IN (1)
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `memberships`.`collection_id` FROM `memberships`  WHERE `memberships`.`user_id` = 1
---
  def index
    respond_to do |format|
      format.html
      format.json do
        acts = Activity.order('id desc').includes(:collection, :site, :user)
        acts = acts.limit(25)
        acts = acts.where('id < ?', params[:before_id]) if params[:before_id]

        if params[:collection_ids]
          params[:collection_ids].each_with_index do |c_id, key|
            if c_id == 'null'
              params[:collection_ids][key] = nil
              break
            end
          end

          acts = acts.where("collection_id in (?) or user_id = ?", params[:collection_ids], current_user.id)
          acts = acts.where(collection_id: params[:collection_ids])

        else
          acts = acts.where("collection_id IN (?) or user_id = ?", current_user.memberships.pluck(:collection_id), current_user.id)