app/controllers/collections_controller.rb

INSERT INTO `collections` (`created_at`, `description`, `icon`, `name`, `public`, `updated_at`) VALUES ('2018-07-19 07:35:00', '', 'drugstore', 'My Collection', 0, '2018-07-19 07:35:00')
UPDATE `users` SET `collection_count` = 1, `success_outcome` = 0, `updated_at` = '2018-07-19 07:35:06' WHERE `users`.`id` = 1
---
  def create
    if current_user.create_collection collection
      current_user.collection_count += 1
      current_user.update_successful_outcome_status

UPDATE `collections` SET `is_visible_location` = 0, `updated_at` = '2018-07-23 02:28:36' WHERE `collections`.`id` = 3
---
  def update
    if collection.update_attributes params[:collection]