app/controllers/gateways_controller.rb

SELECT channels.id,channels.name,channels.password,channels.is_enable,channels.basic_setup, channels.advanced_setup, channels.national_setup FROM `channels`  WHERE `channels`.`user_id` = 1
---
  def index
    method = Channel.nuntium_info_methods
    respond_to do |format|
      format.html
      format.json { render json: (params[:without_nuntium] ?  current_user.channels.where("channels.is_enable=?", true).all.as_json : current_user.channels.select('channels.id,channels.name,channels.password,channels.is_enable,channels.basic_setup, channels.advanced_setup, channels.national_setup').all.as_json(methods: method)), :root => false}