app/controllers/layers_controller.rb

SELECT `fields`.* FROM `fields`  WHERE `fields`.`layer_id` IN (1)  ORDER BY ord
---
  def index
    respond_to do |format|
      format.html do
        show_collection_breadcrumb
        add_breadcrumb I18n.t('views.collections.index.properties'), collection_path(collection)
        add_breadcrumb I18n.t('views.collections.tab.layers'), collection_layers_path(collection)
      end
      if current_user_snapshot.at_present?
        json = layers.includes(:fields).all.as_json(:include => {:fields => {except: [:updated_at, :created_at]}}).each { |layer|

INSERT INTO `layers` (`collection_id`, `created_at`, `name`, `ord`, `updated_at`) VALUES (3, '2018-07-19 07:36:45', 'My Layer', 1, '2018-07-19 07:36:45')
UPDATE `users` SET `layer_count` = 1, `updated_at` = '2018-07-19 07:36:46' WHERE `users`.`id` = 1
---
  def create
    layer = layers.new params[:layer]
    layer.user = current_user
    layer.save!
    current_user.layer_count += 1
    current_user.update_successful_outcome_status