app/controllers/memberships_controller.rb

SELECT `layer_memberships`.* FROM `layer_memberships`  WHERE `layer_memberships`.`collection_id` = 3
SELECT `memberships`.* FROM `memberships`  WHERE `memberships`.`collection_id` = 3
SELECT  `memberships`.* FROM `memberships`  WHERE `memberships`.`user_id` = 1 AND `memberships`.`collection_id` = 3  ORDER BY `memberships`.`id` ASC LIMIT 1
SELECT  `sites_permissions`.* FROM `sites_permissions`  WHERE `sites_permissions`.`type` IN ('NoneSitesPermission') AND `sites_permissions`.`membership_id` = 1 LIMIT 1
SELECT `users`.* FROM `users`  WHERE `users`.`id` IN (1)
---
  def index
    layer_memberships = collection.layer_memberships.all.inject({}) do |hash, membership|
      (hash[membership.user_id] ||= []) << membership
      hash
    end
    memberships = collection.memberships.includes([:user, :read_sites_permission, :write_sites_permission]).all.map do |membership|